In [2]:
import numpy as np
import pandas as pd

In [5]:
data_frame = pd.read_excel("students.xlsx")
data_frame

   id name  q1  assign  mid  compre
0   1    A   5      10    5      35
1   2    B   4       9   23      21
2   3    C   3       6   12      23
3   4    D   4       2   23      23
4   5    E   1       7   11      11

In [6]:
data_frame.index

RangeIndex(start=0, stop=5, step=1)

In [8]:
data_frame.columns

Index(['id', 'name', 'q1', 'assign', 'mid', 'compre'], dtype='object')

In [9]:
data_frame.dtypes

id         int64
name      object
q1         int64
assign     int64
mid        int64
compre     int64
dtype: object

In [10]:
data_frame.head(2)

   id name  q1  assign  mid  compre
0   1    A   5      10    5      35
1   2    B   4       9   23      21

In [12]:
data_frame.tail(2)

   id name  q1  assign  mid  compre
3   4    D   4       2   23      23
4   5    E   1       7   11      11

In [14]:
data_frame.id

0    1
1    2
2    3
3    4
4    5
Name: id, dtype: int64

In [16]:
type(data_frame["name"])

pandas.core.series.Series

In [17]:
list_of_columns= ["id", "name"]
data_frame[list_of_columns]

   id name
0   1    A
1   2    B
2   3    C
3   4    D
4   5    E

In [18]:
type(data_frame[list_of_columns])

pandas.core.frame.DataFrame

In [19]:
sub_df = data_frame[list_of_columns]
sub_df

   id name
0   1    A
1   2    B
2   3    C
3   4    D
4   5    E

In [20]:
data_frame

   id name  q1  assign  mid  compre
0   1    A   5      10    5      35
1   2    B   4       9   23      21
2   3    C   3       6   12      23
3   4    D   4       2   23      23
4   5    E   1       7   11      11

In [21]:
data_frame.loc[0]

id         1
name       A
q1         5
assign    10
mid        5
compre    35
Name: 0, dtype: object

In [22]:
data_frame.loc[1:3]

   id name  q1  assign  mid  compre
1   2    B   4       9   23      21
2   3    C   3       6   12      23
3   4    D   4       2   23      23

In [23]:
data_frame.loc[0, "id"]

1

In [24]:
#Get all the row after index 2
data_frame.loc[2:]

   id name  q1  assign  mid  compre
2   3    C   3       6   12      23
3   4    D   4       2   23      23
4   5    E   1       7   11      11

In [26]:
data_frame.loc[0:2, ['id', 'name', 'q1']]

   id name  q1
0   1    A   5
1   2    B   4
2   3    C   3

In [27]:
#Access the zeroth row
data_frame.iloc[0]

id         1
name       A
q1         5
assign    10
mid        5
compre    35
Name: 0, dtype: object

In [28]:
#Access first three rows
data_frame.iloc[0:3]

   id name  q1  assign  mid  compre
0   1    A   5      10    5      35
1   2    B   4       9   23      21
2   3    C   3       6   12      23

In [29]:
#Acess every alternate row
data_frame.iloc[::2]

   id name  q1  assign  mid  compre
0   1    A   5      10    5      35
2   3    C   3       6   12      23
4   5    E   1       7   11      11

In [30]:
#Access explicit columns of second row
data_frame.iloc[1, [0, 2, 3]]

id        2
q1        4
assign    9
Name: 1, dtype: object

In [32]:
#Access the rows which fulfills the condition
data_frame[ data_frame.q1 > 3]

   id name  q1  assign  mid  compre
0   1    A   5      10    5      35
1   2    B   4       9   23      21
3   4    D   4       2   23      23

In [34]:
#Access the rows which fulfills both condition
data_frame[ (data_frame.q1 > 3) & (data_frame.q1 > 3)]

   id name  q1  assign  mid  compre
0   1    A   5      10    5      35
1   2    B   4       9   23      21
3   4    D   4       2   23      23

In [35]:
data_frame

   id name  q1  assign  mid  compre
0   1    A   5      10    5      35
1   2    B   4       9   23      21
2   3    C   3       6   12      23
3   4    D   4       2   23      23
4   5    E   1       7   11      11

DataFrame also has an isin() method. When calling isin, pass a set of values as either an array or dict. If values is an array, isin returns a DataFrame of booleans that is the same shape as the original DataFrame, with True wherever the element is in the sequence of values.

In [37]:
marks = [3, 4]
data_frame.isin(marks)

      id   name     q1  assign    mid  compre
0  False  False  False   False  False   False
1  False  False   True   False  False   False
2   True  False   True   False  False   False
3   True  False   True   False  False   False
4  False  False  False   False  False   False